Scratch/ScratchWCF.ReadCoats/ScratchWCF.ReadCoats/Resources/Request_GetAgents.txt

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><s:Header><a:Action s:mustUnderstand="1">http://tempuri.org/IService/GetAgents</a:Action><a:MessageID>urn:uuid:{6}</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">https://serviceapi.realbaselive.com/Service.svc/soapService</a:To><o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><u:Timestamp u:Id="_0"><u:Created>{0}</u:Created><u:Expires>{1}</u:Expires></u:Timestamp><c:SecurityContextToken u:Id="{4}" xmlns:c="http://schemas.xmlsoap.org/ws/2005/02/sc"><c:Identifier>{7}</c:Identifier></c:SecurityContextToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/><Reference URI="#_0"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>{2}</DigestValue></Reference></SignedInfo><SignatureValue>{3}</SignatureValue><KeyInfo><o:SecurityTokenReference><o:Reference ValueType="http://schemas.xmlsoap.org/ws/2005/02/sc/sct" URI="#{5}"/></o:SecurityTokenReference></KeyInfo></Signature></o:Security></s:Header><s:Body><GetAgents xmlns="http://tempuri.org/"/></s:Body></s:Envelope>